### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.web_apps_itn.azurerm_role_assignment.audit_event_container_op_func_itn["8dad3c3a-fd63-4f0d-bdf1-51031c1935ad"] will be created
  + resource "azurerm_role_assignment" "audit_event_container_op_func_itn" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8dad3c3a-fd63-4f0d-bdf1-51031c1935ad"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfimsauditst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps_itn.azurerm_role_assignment.audit_event_container_op_func_itn["c842ff1a-49c0-407d-9a76-210489abb536"] will be created
  + resource "azurerm_role_assignment" "audit_event_container_op_func_itn" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c842ff1a-49c0-407d-9a76-210489abb536"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnfimsauditst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps_itn.module.op_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Web/sites/io-p-itn-fims-op-func-01"
        name                                           = "io-p-itn-fims-op-func-01"
        tags                                           = {
            "BusinessUnit"                                   = "App IO"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
              - "APPINSIGHTS_SAMPLING_PERCENTAGE",
              - "NODE_ENV",
                "SLOT_TASK_HUBNAME",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
                "AzureFunctionsWebHost__hostid",
              + "NODE_ENV",
                "AzureWebJobs.ManageAuditEvent.Disabled",
            ]
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.web_apps_itn.module.op_func.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-fims-rg-01/providers/Microsoft.Web/sites/io-p-itn-fims-op-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"                           = "App IO"
            "CostCenter"                             = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "IO Comunicazione"
            "Source"                                 = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (30 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```

</details>
